create_clock -period 15.000 -name clk -waveform {0.000 7.500} [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.010 [get_ports {cmd[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.200 [get_ports {cmd[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.010 [get_ports {in[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.200 [get_ports {in[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.010 [get_ports cmd_isReady]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.200 [get_ports cmd_isReady]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.010 [get_ports in_isReady]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.200 [get_ports in_isReady]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.010 [get_ports out_canReceive]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.200 [get_ports out_canReceive]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.010 [get_ports rst]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.200 [get_ports rst]
set_output_delay -clock [get_clocks clk] -min -add_delay -0.010 [get_ports {out[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.200 [get_ports {out[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -0.010 [get_ports cmd_canReceive]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.200 [get_ports cmd_canReceive]
set_output_delay -clock [get_clocks clk] -min -add_delay -0.010 [get_ports in_canReceive]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.200 [get_ports in_canReceive]
set_output_delay -clock [get_clocks clk] -min -add_delay -0.010 [get_ports out_isReady]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.200 [get_ports out_isReady]
